import { Component, OnInit } from '@angular/core';
import { ActivatedRoute } from '@angular/router';
import { Member } from './member.model';

@Component({
  selector: 'app-member',
  templateUrl: './member.component.html',
  styleUrls: ['./member.component.css']
})
export class MemberComponent implements OnInit {

  member: Member
  // TEMP
  id: string
  metadataTop = [
    ['Чл. номер:', '0001'],
    ['ЕГН:', '9708137241'],
    ['Име:', 'Момчил Василев'],
    ['Телефон:', '0886744800'],
    ['Email:', 'm.v.vassilev@abv.bg'],
    ['Специалност:', 'Физиотерапевт'],
    ['Адрес:', 'София, кв.Филиповци, ул.Люлин 22'],
  ]

  metadataBottom = [
    ['Пол:', 'Мъж'],
    ['Дата:', '01/01/2020'],
    ['Регион:', 'Западен'],
    ['Служебен адрес:', 'София, кв.Филиповци, ул.Люлин 22'],
    ['Адрес за кореспонденция:', 'София, кв.Филиповци, ул.Люлин 22']
  ]

  metadataCertificates = [
    ['Дипломи:', [
      [['степен:','Бакалавър'],['№','ТК-12004821'],['учебно заведение','Софийски университет'],['специалност:','Кинезитерпевт'],['продължителност:','2015-2020']],
      [['степен:','Бакалавър'],['№','ТК-12004821'],['учебно заведение','Софийски университет'],['специалност:','Кинезитерпевт'],['продължителност:','2015-2020']],
      [['степен:','Бакалавър'],['№','ТК-12004821'],['учебно заведение','Софийски университет'],['специалност:','Кинезитерпевт'],['продължителност:','2015-2020']]
    ]],
    ['Курсове:', [
      [['дата:','11.05.2020'],['№','ТК-12004821'],['име:','Класически спортен тейпинг'],['лектор:','доц.Петров']],
      [['дата:','11.07.2020'],['№','ТК-12004821'],['име','PNF - I част (A)'],['лектор:','доц.Иванов']]
    ]],
    ['Допълнителни квалификации:', [
      [['степен:','Бакалавър'],['№','ТК-12004821'],['учебно заведение','Софийски университет'],['специалност:','Кинезитерпевт'],['продължителност:','2015-2020']],
      [['степен:','Бакалавър'],['№','ТК-12004821'],['учебно заведение','Софийски университет'],['специалност:','Кинезитерпевт'],['продължителност:','2015-2020']]
    ]],
    ['Административни наказания:', [
      [['степен:','Бакалавър'],['№','ТК-12004821'],['учебно заведение','Софийски университет'],['специалност:','Кинезитерпевт'],['продължителност:','2015-2020']],
      [['степен:','Бакалавър'],['№','ТК-12004821'],['учебно заведение','Софийски университет'],['специалност:','Кинезитерпевт'],['продължителност:','2015-2020']]
    ]],
    ['Сертификат за членство:', '01/01/2020'],
    ['Членство:', 'София, кв.Филиповци, ул.Люлин 22'],
    ['Членски внос:', 'София, кв.Филиповци, ул.Люлин 22']
  ]
  // TEMP
  /**
        public workContractID: string,
        public mainAddress: string,
        public declaration: boolean,
        public penaltyID: string
   */
  constructor(private route: ActivatedRoute) { }

  ngOnInit() {
    // this.member = {
    //   id: this.route.snapshot.params['id'],

    // };
    this.id = this.route.snapshot.params['id']
  }
}
